{"_id":{"$oid":"5677d65974bb808408ab177f"},"title":"Jimmy Carter Addresses Sunday School Class Hours After The Sudden Death Of His Grandson","content":"Former President Jimmy Carter broke the news to his church on Sunday that his grandson Jeremy Carter died suddenly at the age of 28, using the occasion to speak candidly about grief.\r\nAs first reported by the Atlanta Journal-Constitution, Carter arrived at church about 25 minutes late and told his Sunday school class that Jeremy had died just hours earlier.\r\nDespite his sudden loss, Carter told the congregation to “be filled with a sense of joy and thanksgiving.\"\r\n“I should be joyful and thankful to God for giving me both life and freedom,” he said.\r\nThe former president regularly teaches Sunday school at Maranatha Baptist Church in his hometown of Plains, Georgia. Just two weeks ago, Carter, 91, appeared under more happy circumstances -- he announced to the church that radiation treatment had successfully eliminated his cancer.\r\nThe church's pastor, Jeremy Shoulta, confirmed Sunday's announcement to CNN, saying that the death of Carter's grandson was \"very unexpected\" and \"shocking news.\" \r\n\"Jeremy Carter had not been feeling well [on Saturday], and at some point later in the day he had gone to sleep, and during the course of that time, his heart stopped,\" he said. \"[President Carter] was shaken. He was obviously sad, although he was able to teach and he was able to present the lesson as well as he always has. But it was apparent to everyone there that this was weighing on him very heavily.\"\r\nCarter told the church that it was the first time he had been late to services. Fellow members told the Atlanta Journal-Constitution that they were moved by his words.\r\n“I’m not surprised,” Jan Williams said. “That’s the kind of Christian he is. Everything that happens in life, good or bad, he uses as a teaching experience. He lives his life as a lesson for other people to see.”","image":{"originalname":"carter.jpeg","encoding":"7bit","mimitype":null,"destination":"news_images/","filename":"81130ffc172304d9706a654d87b6505b","size":52115}}
{"_id":{"$oid":"5677d6b174bb808408ab1780"},"title":"Kelly Slater Just Built A Perfect Artificial Wave -- And It May Save Surfing","content":"The surfing world is abuzz after world champion Kelly Slater casually took to Instagram on Friday to unveil what he says is, without a doubt, the \"best man-made wave ever made.\"\r\n\"It's a freak of technology,\" Slater said of the wave.\r\nThe wave generator, located in a \"secret spot\" about 110 miles from an undisclosed coast, has been in the works for a while.\r\nAs he writes on Instagram, Slater has been \"sitting on\" his announcement for a couple of weeks. \r\n\"For nearly ten years, my team and I have been working on creating the first truly world-class, high-performance, human-made waves,\" he writes. \"This is something I dreamt about as a kid. Through rigorous science and technology, we’ve been able to design and build what some said was impossible, and many very understandably never thought would actually happen.\"","image":{"originalname":"kelly.png","encoding":"7bit","mimitype":null,"destination":"news_images/","filename":"4f5fae1748cdde85f3b7d9c0716215bb","size":261942}}
{"_id":{"$oid":"5677d76c74bb808408ab1781"},"title":"The Huge Growth In Tech Has Created Digital Inequality","content":"The trends are clear: In 2017, we're going to be more connected on more devices creating more data than ever in human history. But what does that mean for us? And what does it mean for the economy? According to a new report from the McKinsey Global Institute, some people and companies are benefiting enormously from the digitization of America. And some people... are being left behind.\r\n\"What those at the frontier have, from companies to consumers, is a much better grasp of what's available or what can be done,\" Sree Ramaswamy, a senior fellow at McKinsey's research arm, told The Huffington Post last week.\r\n\"There are some institutions, industries, consumers and workers that are doing a lot better,\" he went on. \"They are seeing disproportionate gains -- and we see a gap between 'haves' and 'have-mores,' which runs counter to a narrative of 'haves' and 'have-nones.'\"","image":{"originalname":"digital.jpeg","encoding":"7bit","mimitype":null,"destination":"news_images/","filename":"8bfbb6b5ac2097017f4abbbfe3b857f4","size":50527}}
